In [1]:
# import pandas
import pandas as pd

In [2]:
# Two datatypes
series = pd.Series(["BMW","Toyota","Honda"])
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [3]:
# series = 1 dimensional

In [4]:
colours = pd.Series(["Red", "Green", "Blue"])
colours

0      Red
1    Green
2     Blue
dtype: object

In [5]:
# DataFrame = 2 Dimensional

In [6]:
car_data = pd.DataFrame({"Car make": series, "Color": colours})
car_data

  Car make  Color
0      BMW    Red
1   Toyota  Green
2    Honda   Blue

In [7]:
# Import data from CSV
car_sales = pd.read_csv("../data/car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [8]:
# Exporting dataframe
# Note: We need add index=False to exporting function "to_csv" for not add other index 
car_sales.to_csv("../data/exported-car-sales.csv", index=False)

In [9]:
exported_car_sales = pd.read_csv("../data/exported-car-sales.csv")
exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [10]:
## Describe data

In [11]:
# Attribute
car_sales.dtypes

# Functions
# car_sales.to_csv()

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [12]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [13]:
# columns attribute, create a list columns name from dataframe
car_sales_columns = car_sales.columns
car_sales_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [14]:
# Index attribute no exist in list
car_sales_columns.index

AttributeError: 'Index' object has no attribute 'index'

In [ ]:
car_sales.index

In [ ]:
car_sales

In [ ]:
# describe function, give information like count, mean, std, etc about integer column data.
car_sales.describe()

In [ ]:
# give the information to see if exist some data is missing
car_sales.info()

In [ ]:
car_sales.mean(numeric_only=True)

In [16]:
amazon_data = pd.read_csv("../data-course/amazon.csv", encoding="latin-1")
amazon_data

      year      state     month number      date  Random
0     1998       Acre   Janeiro      0  1/1/1998      63
1     1999       Acre   Janeiro      0  1/1/1999      94
2     2000       Acre   Janeiro      0  1/1/2000      90
3     2001       Acre   Janeiro      0  1/1/2001      71
4     2002       Acre   Janeiro      0  1/1/2002      40
...    ...        ...       ...    ...       ...     ...
6449  2012  Tocantins  Dezembro    128  1/1/2012      46
6450  2013  Tocantins  Dezembro     85  1/1/2013      53
6451  2014  Tocantins  Dezembro    223  1/1/2014      89
6452  2015  Tocantins  Dezembro    373  1/1/2015      50
6453  2016  Tocantins  Dezembro    119  1/1/2016      30

[6454 rows x 6 columns]

In [18]:
amazon_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    6454 non-null   int64
 1   state   6454 non-null   object
 2   month   6454 non-null   object
 3   number  6339 non-null   object
 4   date    6454 non-null   object
 5   Random  6454 non-null   int64
dtypes: int64(2), object(4)
memory usage: 302.7+ KB

In [20]:
amazon_data.describe()

              year       Random
count  6454.000000  6454.000000
mean   2007.461729    50.066315
std       5.746654    29.067249
min    1998.000000     0.000000
25%    2002.000000    25.000000
50%    2007.000000    50.000000
75%    2012.000000    75.000000
max    2017.000000   100.000000